In [5]:
import pandas as pd
import numpy as np

In [10]:
elements = [1, 2, 3]
ser = pd.Series(elements)
ser

0    1
1    2
2    3
dtype: int64

In [11]:
ser.shape

(3,)

In [12]:
elements = [1, 'a', True]
arr = np.array(elements)
print([type(a) for a in arr])

[<class 'numpy.str_'>, <class 'numpy.str_'>, <class 'numpy.str_'>]

In [13]:
elements = [1, 'a', True]
ser = pd.Series(elements)
print([type(a) for a in ser])

[<class 'int'>, <class 'str'>, <class 'bool'>]

In [14]:
elements = [[1, 2, 3], [4,5,6]]
ser = pd.Series(elements)
ser

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [17]:
#elements

df = pd.DataFrame(data=elements)
df

   0  1  2
0  1  2  3
1  4  5  6

In [21]:
elements = {
    'a':[1,2,3],
    'b':[4,5,6],    
}
df = pd.DataFrame(elements, index=['rij1', 'rij2', 'rij3'])
df

      a  b
rij1  1  4
rij2  2  5
rij3  3  6

In [26]:
df['c'] = df['a'] + df['b']
df

      a  b  c
rij1  1  4  5
rij2  2  5  7
rij3  3  6  9

In [27]:
df.drop(['c'],axis=1)

      a  b
rij1  1  4
rij2  2  5
rij3  3  6

In [28]:
df

      a  b  c
rij1  1  4  5
rij2  2  5  7
rij3  3  6  9

In [29]:
df.drop(['c'],axis=1,inplace=True) # df = df.drop(['c'],axis=1)
df

      a  b
rij1  1  4
rij2  2  5
rij3  3  6

In [36]:
df

      a  b   c
rij1  1  4   4
rij2  2  5  10
rij3  3  6  18

In [37]:
df.shape

(3, 3)

In [38]:
df.describe()

         a    b          c
count  3.0  3.0   3.000000
mean   2.0  5.0  10.666667
std    1.0  1.0   7.023769
min    1.0  4.0   4.000000
25%    1.5  4.5   7.000000
50%    2.0  5.0  10.000000
75%    2.5  5.5  14.000000
max    3.0  6.0  18.000000

In [39]:
np.random.rand(101) # steeds zelfde random waardes
data = {
    'time':[i*10 for i in range(5)],
    'value_1':np.random.rand(5),
    'value_2':np.random.rand(5)*10
}

In [41]:
data

{'time': [0, 10, 20, 30, 40],
 'value_1': array([0.85479808, 0.63789703, 0.11003261, 0.90570958, 0.40723104]),
 'value_2': array([8.14020819, 5.35201159, 2.9125195 , 2.24708756, 9.82181687])}

In [42]:
df = pd.DataFrame(data)
df

   time   value_1   value_2
0     0  0.854798  8.140208
1    10  0.637897  5.352012
2    20  0.110033  2.912520
3    30  0.905710  2.247088
4    40  0.407231  9.821817

In [43]:
df = df.set_index('time')
df

       value_1   value_2
time
0     0.854798  8.140208
10    0.637897  5.352012
20    0.110033  2.912520
30    0.905710  2.247088
40    0.407231  9.821817

In [44]:
df.loc[10]

value_1    0.637897
value_2    5.352012
Name: 10, dtype: float64

In [45]:
df.iloc[1]

value_1    0.637897
value_2    5.352012
Name: 10, dtype: float64

In [46]:
df.loc[10]['value_2'] # of df.iloc[1]['value_2']

5.352011587851172

In [47]:
df['value_3'] = df['value_1'] + df['value_2']
df

       value_1   value_2    value_3
time
0     0.854798  8.140208   8.995006
10    0.637897  5.352012   5.989909
20    0.110033  2.912520   3.022552
30    0.905710  2.247088   3.152797
40    0.407231  9.821817  10.229048

In [55]:
df.loc[[0,10,20,40]][['value_1','value_3']]

       value_1    value_3
time
0     0.854798   8.995006
10    0.637897   5.989909
20    0.110033   3.022552
40    0.407231  10.229048

In [56]:
df

       value_1   value_2    value_3
time
0     0.854798  8.140208   8.995006
10    0.637897  5.352012   5.989909
20    0.110033  2.912520   3.022552
30    0.905710  2.247088   3.152797
40    0.407231  9.821817  10.229048

In [57]:
df > 0.5

      value_1  value_2  value_3
time
0        True     True     True
10       True     True     True
20      False     True     True
30       True     True     True
40      False     True     True

In [58]:
df[df>0.5]

       value_1   value_2    value_3
time
0     0.854798  8.140208   8.995006
10    0.637897  5.352012   5.989909
20         NaN  2.912520   3.022552
30    0.905710  2.247088   3.152797
40         NaN  9.821817  10.229048

In [59]:
df = df[(df>0.5) & (df<5.0)]
df

       value_1   value_2   value_3
time
0     0.854798       NaN       NaN
10    0.637897       NaN       NaN
20         NaN  2.912520  3.022552
30    0.905710  2.247088  3.152797
40         NaN       NaN       NaN

In [67]:
df.dropna(axis=0, thresh=2)

      value_1   value_2   value_3
time
20        NaN  2.912520  3.022552
30    0.90571  2.247088  3.152797

In [68]:
df # denk om inline!

       value_1   value_2   value_3
time
0     0.854798       NaN       NaN
10    0.637897       NaN       NaN
20         NaN  2.912520  3.022552
30    0.905710  2.247088  3.152797
40         NaN       NaN       NaN

In [70]:
df['value_1'] = df['value_1'].fillna(df['value_1'].mean())
# sklearn !

       value_1   value_2   value_3
time
0     0.854798       NaN       NaN
10    0.637897       NaN       NaN
20    0.799468  2.912520  3.022552
30    0.905710  2.247088  3.152797
40    0.799468       NaN       NaN

In [71]:
df1 = pd.DataFrame({'a':[10,20],'b':['a1','a2']})
df2 = pd.DataFrame({'c':[1,2,3],'d':['x','y','z']})
print(df1)
print(df2)

    a   b
0  10  a1
1  20  a2
   c  d
0  1  x
1  2  y
2  3  z

In [74]:
df3 = pd.concat([df1,df2],axis=1)
df3

      a    b  c  d
0  10.0   a1  1  x
1  20.0   a2  2  y
2   NaN  NaN  3  z

In [81]:
def f(x):
    return x**3

df = pd.DataFrame({'a':[1,2,3], 'b':[4,5,6]})
df.apply(f)

    a    b
0   1   64
1   8  125
2  27  216

In [79]:
df['a'].apply(lambda x: x**3)

0     1
1     8
2    27
Name: a, dtype: int64